# AddConstraintArcLength Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinitionByArc..::..AddConstraintArcLength Method
RebarShapeDefinitionByArc Class See Also
---
Specify a parameter to drive the arc length of the shape.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public void AddConstraintArcLength(
	ElementId paramId
)
```

Visual Basic
---
```text
Public Sub AddConstraintArcLength ( _
	paramId As ElementId _
)
```

Visual C++
---
```text
public:
void AddConstraintArcLength(
	ElementId^ paramId
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace